Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཅུ་སྟེ། །ཀུན་ལའང་ཆགས་པ་མེད་པར་གྱུར་དེ་དག །བྱེ་བ་ཕྲག་ནི་སྟོང་སྟོང་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering ten billion Who are all free from attachment.

source: རྒྱལ་བ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བྱེ་བ་སྟོང་། །
en: When this victor has attained nirvāṇa His relics will be abundant and reside in ten billion stūpas.

source: འཇིག་རྟེན་མགོན་པོ་རྒྱལ་བ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་རྒྱལ་བར་དཀའ་བ་ཞེས་ཀྱང་བྱ། །
en: “The protector of the world, Jaya, Will be born in a place called Hard to Conquer.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཁྲི་དབང་པོ་ཆེན་པོ་ཡབ། །རྒྱགས་སྲེད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend twenty thousand leagues. “Great Ruler will be his father, and Free from Conceit will be this victor’s mother.

source: སྲས་པོ་རྣམ་ངེས་ཟླ་བ་རིམ་གྲོ་པ། །
en: Ascertainment will be his son and Moon his attendant.

source: ཆོས་ཀྱི་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Dharma Mode will be the scholar

source: ཕྱིར་ཞིང་ལེགས་པར་སེམས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Continuous Excellent Intention the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། །ཀུན་ལའང་དགྲ་བཅོམ་ལེགས་པར་ཚོགས་པའི་གྲངས། །བྱེ་བ་ཕྲག་ནི་འབུམ་འབུམ་འདུས་པར་འགྱུར། །
en: “There will be eighty-four consecutive congregations, Each of them bringing together A fine gathering of one trillion worthy ones.

source: དམ་ཆོས་ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་གནས། །
en: “And the sacred Dharma will remain for seventy-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་གསུམ་པ་གསེར་གྱི་བླ་རེར་ལྡན། །རྟ་བབས་བྱེ་བ་སྟོང་ཕྲག་བཅུ་ཡང་ཡོད། །
en: The relics of this victor will reside in a single stūpa Measuring three leagues, adorned with golden canopies, And surrounded by a hundred billion archways.

source: དེ་བཞིན་གཤེགས་པ་རྒྱ་ཆེན་སྙིང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་པ་མཐའ་ཡས་ཡིན། །
en: “The thus-gone Udāragarbha Will be born in a place called Infinite Worship.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་ལེགས་རྟོགས་ཡིན། །ཐར་འདོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Excellent Realization will be his father, and Wish for Liberation will be this victor’s mother.

source: སྲས་པོ་ལེགས་གྲོལ་རྣམ་གྲོལ་རིམ་གྲོ་པ། །
en: Excellent Liberation will be his son and Liberation his attendant.

source: ས་ཡི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Light of the Ground will be the scholar

source: བདུད་རྣམས་ཕུང་བར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Defeater of the Māras the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །མཁའ་དང་མཚུངས་པའི་སེམས་ཐོབ་དྲང་སྲོང་དག །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred twenty million Sages who have accomplished a mind equal to the sky.

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་ཆིག་འབུམ་དང་། །ཉི་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma will remain For one hundred twenty-one thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ལྔ་པ་གཅིག །གཙུག་གི་ནོར་བུ་སྟོང་ཕྲག་སྙེད་ཀྱང་སྦྱངས། །
en: His relics will reside in a single stūpa Five leagues large and decorated with thousands of crown jewels.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་འོད་ཟེར་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་སྐར་མའི་འོད་ཅེས་བྱ། །
en: “The thus-gone Puṇyaraśmi Will be born in a place called Starlight.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཤུ་བསོད་ནམས་བཟང་པོ་ཡབ། །བསོད་ནམས་འོད་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །བསོད་ནམས་སྟོབས་ཡིན་ཡོན་ཏན་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend twenty leagues. “Excellent Merit will be his father, and Light of Merit will be this victor’s mother. Strength of Merit will be his son and Qualities his attendant.

source: ཡོན་ཏན་ཁ་ལོ་སྒྱུར་བ་མཁས་པ་སྟེ། །
en: Leader Qualities will be the scholar

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །ཐེག་པ་མཆོག་གིས་རྣམ་ཐར་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་རེ་རེ་ཡོད། །
en: “There will be seventy-six consecutive congregations, Each of them gathering seven hundred million Who have accomplished liberation by means of the Great Vehicle.

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And for the benefit of wandering beings The sacred Dharma will remain for seventy-one thousand years.

source: འཇིག་རྟེན་མགོན་པོ་འོད་ཟེར་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འོད་རྟག་པ་ཞེས་བྱ། །
en: “The protector of the world, Suraśmi, Will be born in a place called Constant Light.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བརྒྱད་ཡབ་ནི་ལྷག་མཐོང་ཡིན། །འོད་ཀྱིས་བརྒྱན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-eight leagues. “Special Insight will be his father, and Light Ornament will be this victor’s mother.

source: སྲས་པོ་འོད་བྱིན་འོད་ཅན་རིམ་གྲོ་པ། །
en: Light Gift will be his son and Luminous his attendant.

source: དེས་པའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Gentle Light will be the scholar

source: འདུས་པ་ལན་གྲངས་བརྒྱ་སྟེ་ཀུན་ལ་ཡང་། །རི་མཚུངས་འཁྲུགས་པ་མེད་པར་གྱུར་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be one hundred consecutive congregations, Each of them gathering nine hundred ninety million Who remain unshakable, like mountains.

source: དམ་ཆོས་ལོ་གྲངས་དགུ་བཅུ་རྩ་དྲུག་གནས། །
en: “And the sacred Dharma will remain for ninety-six years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བཞི་པ་གཅིག །རིན་ཆེན་བརྒྱ་ཡི་ཆུན་པོ་རབ་དཔྱངས་ལ། །སིལ་སྙན་བྱེ་བ་བརྒྱ་སྙེད་སྒྲ་ཡང་འཁྲོལ། །
en: His relics will reside in a stūpa four leagues large, Adorned with tassels of hundreds of jewels And emitting the sounds of one billion cymbals.

source: མཚུངས་པ་མེད་པ་སྨྲང་འདོན་སྐྱེ་བའི་ཡུལ། །མྱ་ངན་རྣམ་པར་འཚང་བར་བྱེད་ཅེས་བྱ། །
en: “The incomparable Śrotriya Will be born in a place called Washing Suffering Away.

source: རྡུལ་བྲལ་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །སྟོང་གསུམ་ཙམ་ཡོད་ཡབ་ནི་མཐུ་ལྡན་ཡིན། །གཟི་བརྗིད་བདོག་པ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡོན་ཏན་ཚོགས་ཡིན་དྲན་ལྡན་རིམ་གྲོ་པ། །
en: His immaculate family will be kṣatriya And his light will extend as far as the billionfold world. “Powerful will be his father, and Possessor of Splendor will be this victor’s mother. Gathering of Qualities will be his son and Mindful his attendant.

source: ཐར་པའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Light of Liberation will be the scholar

source: རྒོལ་བ་ཚར་གཅོད་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Defeater of Attacks the one of miracles.

source: འདུས་པ་དག་ནི་མཐའ་ཡས་ཀུན་ལ་ཡང་། །བྱང་ཆུབ་མཆོག་རབ་དག་ལ་རབ་གནས་པ། །གཟུངས་ཐོབ་ཕྱིར་མི་ལྡོག་པ་ཤ་སྟག་གོ། །
en: “There will infinite congregations, Each of them gathering exclusively irreversible ones who have achieved retention And reside within supreme awakening.

source: མི་ཚེ་ལོ་གྲངས་བྱེ་བ་སྟོང་ཡང་ཡིན། །
en: The lifespan of humans will be ten billion years,

source: ཕྱིར་མི་ལྡོག་པའི་ཚོགས་ཕྱིར་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་བདུན་ཅུ་དྲུག་ཏུ་གནས། །
en: “And for the sake of the gathering of irreversible ones The sacred Dharma will remain for seven hundred sixty million years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །སྟོང་གསུམ་ལྷ་མི་དག་གིས་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, Propagated by gods and humans throughout the trichiliocosm.

source: དེ་བཞིན་གཤེགས་པ་སྒྲོན་མའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་བཟང་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Pradīparāja will be born in a place called Endowed with Excellence.

source: ཡབ་ནི་འོད་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Mountain of Light will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་ཕུང་པོའི་འོད་ཅེས་བྱའོ། །
en: Heap of Splendid Light will be his mother.

source: སྲས་ནི་ངན་སོང་སྤོང་ཞེས་བྱའོ། །
en: Relinquisher of the Lower Realms will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་དོན་ཡོད་ཅེས་བྱའོ། །
en: Meaningful Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱའོ། །
en: Jewel Crest will be foremost in terms of miraculous abilities.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲིའོ། །དམ་པའི་ཆོས་ཀྱང་ལོ་བརྒྱད་ཁྲིའི་བར་དུ་གནས་སོ། །
en: The extent of his lifespan will be eighty thousand years. His sacred Dharma will also remain for eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་བརྩེགས་སྐྱེ་བའི་ཡུལ་ནི་འོད་ལྡན་མ་ཞེས་བྱའོ། །
en: “The thus-gone Jñānakūṭa will be born in a place called Endowed with Light.

source: ཡབ་ནི་ཡེ་ཤེས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Wisdom will be his father.

source: ཡུམ་ནི་གྲགས་པའི་འོད་ཅེས་བྱའོ། །
en: Light of Fame will be his mother.

source: སྲས་ནི་མཐུ་རྩལ་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Precious Power will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གནས་ཞེས་བྱའོ། །
en: Abiding Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་བརྩེགས་པ་ཞེས་བྱའོ། །
en: Array of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Mountain of Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: In the first congregation will gather nine hundred eighty million hearers, in the second there will be nine hundred million, and in the third there will be one billion.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་མཆོག་སྐྱེ་བའི་ཡུལ་ནི་ཡན་ལག་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Uttamadeva will be born in a place called Supreme Limbs.

source: ཡབ་ནི་ཆོས་ལྡན་ཞེས་བྱའོ། །
en: Endowed with Dharma will be his father.

source: སྲས་ནི་ཡན་ལག་མཆོག་ཅེས་བྱའོ། །
en: Supreme Limbs will be his son.

source: རིམ་གྲོ་པ་ནི་ཡན་ལག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Royal Limbs will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལུས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Uncluttered Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་སྒྲིབ་པ་མེད་པ་ཞེས་བྱའོ། །
en: Stainless Insight will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be ten consecutive congregations, each of them gathering eight million.

source: དེ་བཞིན་གཤེགས་པ་སའི་བདག་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཤེས་རབ་འཕགས་ཞེས་བྱའོ། །
en: “The thus-gone Pārthiva will be born in a place called Superior Insight.

source: ཡབ་ནི་དབང་སྒྱུར་ཞེས་བྱའོ། །
en: Master will be his father.

source: ཡུམ་ནི་ཟིལ་གྱིས་མི་ནོན་པ་ཞེས་བྱའོ། །
en: Indomitable will be his mother.

source: སྲས་ནི་གྲགས་མཛེས་ཞེས་བྱའོ། །
en: Fame and Beauty will be his son.

source: རིམ་གྲོ་པ་ནི་སྐྱེ་བོའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa for Humanity will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་དཔའ་བོ་ཞེས་བྱའོ། །
en: Powerful Hero will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་གྱིས་རབ་ཏུ་འགྲོ་བ་ཞེས་བྱའོ། །
en: Moving with Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be fourteen consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་གྲོལ་བརྙེས་སྐྱེ་བའི་ཡུལ་ནི་ཟིལ་གྱིས་མི་ནོན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vimuktilābhin will be born in a place called Indomitable.

source: ཡབ་ནི་ནམ་མཁའི་མཛོད་ཅེས་བྱའོ། །
en: Sky Treasury will be his father.

source: ཡུམ་ནི་མཆོད་པ་བཀོད་པ་ཞེས་བྱའོ། །
en: Array of Offerings will be his mother.

source: སྲས་ནི་ནོར་བུ་བཀོད་པ་ཞེས་བྱའོ། །
en: Array of Jewels will be his son.

source: རིམ་གྲོ་པ་ནི་སྟོན་པར་དགའ་ཞེས་བྱའོ། །
en: Joy in Teaching will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Truth will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དབང་ཕྱུག་ཆེན་པོའི་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Great Mastery will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ཉི་ཁྲི་ཉི་ཁྲིའོ། །
en: There will be thirty consecutive congregations, each of them gathering two hundred billion.

source: དེ་བཞིན་གཤེགས་པ་གཙུག་གི་གསེར་སྐྱེ་བའི་ཡུལ་ནི་དྲན་པའི་གཙུག་ཅེས་བྱའོ། །
en: “The thus-gone Suvarṇacūḍa will be born in a place called Peak of Recollection.

source: ཡབ་ནི་གཟི་བརྗིད་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Precious Splendor will be his father.

source: ཡུམ་ནི་སྔགས་འདོད་མ་ཞེས་བྱའོ། །
en: Wish to Praise will be his mother.

source: སྲས་ནི་རྒྱལ་བུ་ཞེས་བྱའོ། །
en: Prince will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོགས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Unimpeded Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་དུ་ཡོན་ཏན་ཞེས་བྱའོ། །
en: Qualities in All Regards will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be seventeen consecutive congregations, each of them gathering ten thousand.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Rāhubhadra will be born in a place called Infinite Splendor.

source: ཡབ་ནི་རྙོག་པ་མེད་པའི་འོད་ཅེས་བྱའོ། །
en: Immaculate Light will be his father.

source: ཡུམ་ནི་དབྱིག་འགྲོ་མ་ཞེས་བྱའོ། །
en: Jewel Movement will be his mother.

source: སྲས་ནི་བློ་གྲོས་གསལ་བ་ཞེས་བྱའོ། །
en: Clear Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་ཕྱོགས་མཆོད་ཅེས་བྱའོ། །
en: Universal Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐའ་ཡས་བློ་ཞེས་བྱའོ། །
en: Infinite Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལུས་དག་ཅེས་བྱའོ། །
en: Pure Body will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be six consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་ཐུབ་དཀའ་སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་བའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Durjaya will be born in a place called Victorious Light.

source: ཡབ་ནི་འཕགས་འདུལ་ཞེས་བྱའོ། །
en: Superior Training will be his father.

source: ཡུམ་ནི་ལྷའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Divine Flower will be his mother.

source: སྲས་ནི་ལྷའི་འོད་ཅེས་བྱའོ། །
en: Divine Light will be his son.

source: རིམ་གྲོ་པ་ནི་བྱང་ཆུབ་རེག་ཅེས་བྱའོ། །
en: Reaching Awakening will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Virtue will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་འོང་དབྱངས་ཞེས་བྱའོ། །
en: Delightful Melody will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་རེ་རེའོ། །
en: There will be eight consecutive congregations, each of them gathering one hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཐུབ་གསལ་སྐྱེ་བའི་ཡུལ་ནི་རབ་ཏུ་ཞི་བའི་སྟོབས་ཞེས་བྱའོ། །
en: “The thus-gone Muniprasanna will be born in a place called Strength of Serenity.

source: ཡབ་ནི་དབང་པོ་དུལ་ཞེས་བྱའོ། །
en: Sense Control will be his father.

source: ཡུམ་ནི་མཆོད་རྟེན་ཆུང་ཞེས་བྱའོ། །
en: Little Stūpa will be his mother.

source: སྲས་ནི་འགྲོས་བརྟན་ཞེས་བྱའོ། །
en: Stable Mode will be his son.

source: རིམ་གྲོ་པ་ནི་སྒྲིབ་པ་མེད་པའི་འགྲོས་ཞེས་བྱའོ། །
en: Unobscured Mode will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་དཔག་ཏུ་མེད་པ་ཞེས་བྱའོ། །
en: Immeasurable Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Splendor will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be six consecutive congregations, each of them gathering eight hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་ཟེར་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་རྣམ་པར་སྣང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Somaraśmi will be born in a place called Illuminating Joy.

source: ཡབ་ནི་དགའ་བའི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Joy will be his father.

source: ཡུམ་ནི་གསལ་ལྡན་མ་ཞེས་བྱའོ། །
en: Luminous will be his mother.

source: སྲས་ནི་ལྷ་མཆོད་ཅེས་བྱའོ། །
en: Divine Worship will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་ལྷ་ཞེས་བྱའོ། །
en: God of Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་གྲོལ་བས་འཇོམས་ཞེས་བྱའོ། །
en: Liberating Conquest will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མྱ་ངན་མེད་པས་བྱིན་ཞེས་བྱའོ། །
en: Gift of Nirvāṇa will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དགུ་དགུའོ། །
en: There will be seventy consecutive congregations, each of them gathering nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་གསེར་གྱི་འོད་སྐྱེ་བའི་ཡུལ་ནི་གསེར་གྱི་འོད་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Kāñcanaprabha will be born in a place called Endowed with Golden Light.

source: ཡབ་ནི་མཐོང་དགའ་ཞེས་བྱའོ། །
en: Joyous Sight will be his father.

source: ཡུམ་ནི་འཇིག་རྟེན་ལྷ་ཞེས་བྱའོ། །
en: Deity of the World will be his mother.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་སྙིང་པོ་ཞེས་བྱའོ། །
en: Jewel Essence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Infinite Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་པར་དཀའ་ཞེས་བྱའོ། །
en: Hard to Show will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be three consecutive congregations, each of them gathering seven hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་བཅུའོ། །
en: The extent of his lifespan will be ninety years.

source: དམ་པའི་ཆོས་ནི་ལོ་དགུ་བཅུའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ninety years.

source: འཁོར་སེམས་ཅན་ཇི་སྙེད་པ་ཐམས་ཅད་ཀྱང་། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཁོ་ནར་གནས་པ་ཤ་སྟག་གོ། །
en: All the sentient beings in his retinue will without exception be irreversible with respect to the attainment of unsurpassable awakening.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་ཚོགས་ཀྱི་དབང་པོ་དང་མཚུངས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sudatta will be born in a place called Equal to the Master of the Gathering.

source: ཡབ་ནི་ཕྱོགས་ལྟ་ཞེས་བྱའོ། །
en: Seeing in All Directions will be his father.

source: ཡུམ་ནི་འཕགས་དགྱེས་བྱེད་ཅེས་བྱའོ། །
en: Delighting the Noble will be his mother.

source: སྲས་ནི་དུལ་བར་གནས་ཞེས་བྱའོ། །
en: Adhering to the Training will be his son.

source: རིམ་གྲོ་པ་ནི་མཚོན་ཆ་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Weapon will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མེ་ཏོག་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Flower Lamp will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Jewel Lamp will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་ཡོན་ཏན་དབང་པོ་སྐྱེ་བའི་ཡུལ་ནི་ལྷའི་ཡུལ་འཁོར་ཞེས་བྱའོ། །
en: “The thus-gone Guṇendradeva will be born in a place called Divine Land.

source: ཡབ་ནི་ཚངས་ལྟོ་ཞེས་བྱའོ། །
en: Brahmā Sustenance will be his father.

source: ཡུམ་ནི་ཚངས་སྒྲ་ཞེས་བྱའོ། །
en: Brahmā Sound will be his mother.

source: རིམ་གྲོ་པ་ནི་འཕགས་དགྱེས་ཞེས་བྱའོ། །
en: Delighting the Noble will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་བ་དགའ་ཞེས་བྱའོ། །
en: Virtuous Joy will be foremost in terms of insight.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གདུགས་སྐྱེ་བའི་ཡུལ་ནི་དགེ་བའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Dharmacchattra will be born in a place called King of Virtue.

source: ཡབ་ནི་ཟླ་གདུགས་ཞེས་བྱའོ། །
en: Moon Parasol will be his father.

source: ཡུམ་ནི་ལྷ་དགའ་མ་ཞེས་བྱའོ། །
en: Divine Joy will be his mother.

source: སྲས་ནི་ཡོན་ཏན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Wisdom will be his attendant.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be thirty-six consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་ལག་སྐྱེ་བའི་ཡུལ་ནི་ལག་བདག་ཅེས་བྱའོ། །
en: “The thus-gone Puṇyabāhu will be born in a place called Hand Master.

source: ཡབ་ནི་རིན་པོ་ཆེའི་ལག་པ་ཞེས་བྱའོ། །
en: Jewel Hand will be his father.

source: ཡུམ་ནི་ཀླུ་ལག་མ་ཞེས་བྱའོ། །
en: Nāga Hand will be his mother.

source: སྲས་ནི་ལྷའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Divine Stūpa will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་མཆོད་ཅེས་བྱའོ། །
en: Offering of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོག་གི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Supreme King will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་ལྔ་ལྔའོ། །
en: There will be twenty-eight consecutive congregations, each of them gathering five hundred million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་སུམ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for thirty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཆགས་པ་མེད་པ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་གྱི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Asaṅga will be born in a place called Source of Qualities.

source: ཡབ་ནི་ལྟ་བ་གསལ་ཞེས་བྱའོ། །
en: Clear View will be his father.

source: ཡུམ་ནི་ལྟ་དགའ་ཞེས་བྱའོ། །
en: Joyous View will be his mother.

source: སྲས་ནི་ཡིད་བདེ་སྐྱེས་ཞེས་བྱའོ། །
en: Birth of Happy Mind will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷ་མཆོད་ཅེས་བྱའོ། །
en: Divine Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྡོ་རྗེའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Vajra Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཟང་པོའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Excellence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be sixteen consecutive congregations, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གྱ་ནོམ་སྐྱེ་བའི་ཡུལ་ནི་གྱ་ནོམ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Prāṇītajñāna will be born in a place called Infinite Excellence.

source: འོད་ནི་དཔག་ཚད་སུམ་ཁྲིའོ། །
en: His light will extend thirty thousand leagues.

source: སྲས་ནི་ལྷའི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: Divine Wisdom will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Ocean of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡུལ་འཁོར་ལྷ་ཞེས་བྱའོ། །
en: God of the Land will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be thirty consecutive congregations, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ཞིབ་མོ་སྐྱེ་བའི་ཡུལ་ནི་ཉམས་དགའ་བ་འབྱུང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Sūkṣmabuddhi will be born in a place called Source of Delight.

source: ཡབ་ནི་ལུས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Uncluttered Mind will be his father.

source: ཡུམ་ནི་ཡན་ལག་མ་སྨད་པ་ཞེས་བྱའོ། །
en: Impeccable Limbs will be his mother.

source: སྲས་ནི་ཙན་དན་དགའ་ཞེས་བྱའོ། །
en: Sandalwood Joy will be his son.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགྲ་བཅོམ་ལྷ་ཞེས་བྱའོ། །
en: Divine Worthy One will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be fifty consecutive congregations, each of them gathering one hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བྱིན་ཐམས་ཅད་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་བདག་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Sarvatejas will be born in a place called Lord of Splendor.

source: ཡབ་ནི་ཏོག་གི་འོད་ཅེས་བྱའོ། །
en: Crest Light will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་འོད་ཅེས་བྱའོ། །
en: Luminous Qualities will be his mother.

source: རིམ་གྲོ་པ་ནི་སྙན་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་སེམས་ཞེས་བྱའོ། །
en: Divine Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐར་པའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiance of Liberation will be foremost in terms of miraculous abilities.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་ཁྲི་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixty-three thousand years.
